src/cfe/КСП/InformationRegisters/КСП_СтатусВыполненияЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>КСП_СтатусВыполненияЗаданий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КСП_СтатусВыполнения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндексЛога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КСП_ИндексЛога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторФон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КСП_УправлениеЗаданиями</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/Enums/КСП_СтатусВыполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>КСП_СтатусВыполнения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыполненоБезОшибок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполненоСОшибками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрерываниеВыполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/КСП/Enums/КСП_СтатусыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>КСП_СтатусыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предупреждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КритическаяОшибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Информация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отладка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/КСП/Catalogs/КСП_ЛогСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>КСП_ЛогСообщений</Name>
			<Comment>Сюда пишутся детальные сообщения лога</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КСП_СтатусыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДетальноеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КСП_ИндексЛога</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/КСП/Catalogs/КСП_ИндексЛога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>КСП_ИндексЛога</Name>
			<Comment>Фиксирует вызовы процедур</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВремяВызова</Name>
					<Comment>Время вызова процедуры</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодульПроцедура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыВызова</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/КСП/Catalogs/КСП_УправлениеЗаданиями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>КСП_УправлениеЗаданиями</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПроцедураСПараметрами</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыПроцедуры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапускПоРасписанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СледующаяПроцедура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КСП_УправлениеЗаданиями</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтсутствияОтклика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалПовтораПриАварийномЗавершении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПовторовПриАварийномЗавершении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/КСП/CommonModules/КСП_класс_ЗапускЗаданий/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Обработчик регл задания. Старое имя - ЗапускГруппыЗаданий
// Также вызывается из формы списка спр КСП_УправленияЗаданиями,
//		ЗапуститьГруппуНаСервереВФонеБлокироватьИнтерфейс()
//		ЗапуститьГруппуНаСервереВФоне()
// Запускает группу справочника КСП_УправлениеЗаданиями на выполнение.
// Параметры
//	Контекст - структура
//		* Ссылка 				- СправочникСсылка.tm_УправлениеЗаданиями
//		* ЗапускИзСправочника 	- булево - флаг того, что был интерактивный запуск, а не через регл задание
//		* Ключ 					- строка - уникальный ключ задания
//		* ЭтоЦепочка 			- булево - есть задание в реквизите "СледующаяПроцедура"
//											Похоже, что не используется
//		* ОбщиеПараметры		- структура - общие параметры, заданные через форму общих параметров справочника КСП_УправлениеЗаданиями.
//											Актуально только для группы.
//
Процедура ЗапуститьГруппуВФоне(Контекст) Экспорт
	
	//СУУ_ЕНС 19.12.2020 закомментировано ниже, т.к. это расширение, в нем нельзя создавать свои регл задания 
	//ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.КСП_Планировщик);
	Если ТипЗнч(Контекст) <> Тип("Структура") Тогда
		ВызватьИсключение "ЗапуститьГруппуВФоне(). В переменной Контекст должна быть структура!";
	КонецЕсли;
	
	ЗаданиеСсылка 		= ПолучитьСвойствоКонтекста(Контекст,"Ссылка" ,"СправочникСсылка.КСП_УправлениеЗаданиями");
	
	Наименование = "КСП_класс_ЗапускЗаданий.ЗапуститьГруппуВФоне():: ИдВызова, Группа заданий: "+строка(ЗаданиеСсылка);
	ВремяВызова  = ТекущаяДатаСеанса();
	МодульПроцедура = "КСП_класс_ЗапускЗаданий.ЗапуститьГруппуВФоне";
	СписокПар = Новый Структура;
	СписокПар.Вставить("Наименование"   ,Наименование);
	СписокПар.Вставить("ВремяВызова"    ,ВремяВызова);
	СписокПар.Вставить("МодульПроцедура",МодульПроцедура);
	ПараметрыВызова = Новый ХранилищеЗначения(СписокПар, Новый СжатиеДанных(9));
	
	
	// это группа справочника
	ЗаданиеСсылка 		= ПолучитьСвойствоКонтекста(Контекст,"Ссылка" ,"СправочникСсылка.КСП_УправлениеЗаданиями");
	
	ИДВызова = КСП_ЛоггерСервер.СоздатьИдВызова(,Наименование,ВремяВызова,МодульПроцедура,ПараметрыВызова, ЗаданиеСсылка);
	
	клог = КСП_ЛоггерСервер.СоздатьЛоггер(ИДВызова, "ЗапускГруппыЗаданий");
	
	Если НЕ РазрешенЗапускГруппыЗаданий(клог, Контекст)  Тогда
		Возврат;
	КонецЕсли;
	
	Ключ                = ПолучитьСвойствоКонтекста(Контекст,"Ключ"               ,"Строка");
	//ЭтоЦепочка          = ПолучитьСвойствоКонтекста(Контекст,"ЭтоЦепочка"         ,"Булево");
	ОбщиеПараметры		= ПолучитьСвойствоКонтекста(Контекст,"ОбщиеПараметры"	  ,"Структура"); //те, что вводятся в форме общих параметров
	
	Если НЕ ЗначениеЗаполнено(ОбщиеПараметры) Тогда
		ОбщиеПараметры = Неопределено;
	КонецЕсли;
	
	клог.инфо("КСП_класс_ЗапускЗаданий.ЗапуститьГруппуВФоне():: Запуск обработчика регламентных заданий.");
	
	Попытка
		
		// проверим, указана ли следующая группа
		ЕстьСледующий 	= ЗначениеЗаполнено(ЗаданиеСсылка.СледующаяПроцедура);
		ПервыйВЦепочке 	= Истина;
		
		Пока ЕстьСледующий ИЛИ ПервыйВЦепочке Цикл
			
			ПервыйВЦепочке = Ложь;
			
			// Проверим константу в справочнике константы процедур. Нужно проверять все задания по цепочке
			Если КСП_УправлениеЗаданиямиСлужебный.ЕстьЗапретНаЗапускРегламентногоЗадания() Тогда
				клог.Инфо("Обработка регламентных заданий завершена. Обнаружен запрет на запуск регл. заданий");
				Прервать;
			КонецЕсли;
			
			ЗапускИзСправочника = ПолучитьСвойствоКонтекста(Контекст,"ЗапускИзСправочника","Булево"); // Нужно чтобы понять что запуск из справочника и не надо делать проверок по недельному расписанию
			Если ЗапускИзСправочника = Ложь И НЕ РазрешенЗапускПоУсловиям(ЗаданиеСсылка) Тогда
				// запуск задания запрещен по дополнительным условиям
				
				// переопределить текущее задание и уйти на новую итерацию
				ЕстьСледующий = ЗначениеЗаполнено(ЗаданиеСсылка.СледующаяПроцедура);
				Если ЕстьСледующий Тогда
					ЗаданиеСсылка = ЗаданиеСсылка.СледующаяПроцедура;
				КонецЕсли;
				
				клог.Инфо("Пропущен запуск группы """+ЗаданиеСсылка.Наименование+""", т.к. не разрешен по условиям");
				
				Продолжить;
				
			КонецЕсли;
			
			Если Не ЗаданиеСсылка.Активность Тогда
				Продолжить;
			КонецЕсли;
				
			//Это сообщение вяжем к корню
			клог.Инфо("КСП_класс_ЗапускЗаданий.ЗапуститьГруппуВФоне()::>> Запуск группы """+ЗаданиеСсылка.Наименование+"""");
			
			// Для вложенных групп нужно использовать родительский ключ. А для невложенных - создаем новый
			ИдентификаторЗадания = Ключ;
			Если НЕ ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
				ИдентификаторЗадания = Строка(Новый УникальныйИдентификатор);
			КонецЕсли;
			
			//Создадим группе свой ИдВызова
			ИДВызоваГруппа = КСП_ЛоггерСервер.СоздатьИдВызова(ИдВызова,"Пакет """+ЗаданиеСсылка.Наименование+"""",ТекущаяДатаСеанса(),,);
			
			групЛог = КСП_ЛоггерСервер.СоздатьЛоггер(ИДВызоваГруппа, "ЗапускГруппыЗаданий");
			
			групЛог.инфо("Перед запуском группы: %1", ЗаданиеСсылка);
			ЗаписатьСтатусВыполняется(ИДВызоваГруппа,ЗаданиеСсылка,ИдентификаторЗадания);
			
			//						запуск															 //
			///////////////////////////////////////////////////////////////////////////////////////////
			
			// ЕНС 2024-05-26 отключено для отладки
			ЗапускМассиваПараллельныхЗаданий(ИДВызова,ИДВызоваГруппа,ЗаданиеСсылка,ИдентификаторЗадания,ОбщиеПараметры);
			
			///////////////////////////////////////////////////////////////////////////////////////////
			
			РезультатВыполнения = ПолучитьРезультатВыполненияЗаданийИзГруппы(ЗаданиеСсылка,ИдентификаторЗадания);
			ЗаписатьСтатусРезультатВыполнения(ИДВызоваГруппа,ЗаданиеСсылка,РезультатВыполнения,ИдентификаторЗадания);
			групЛог.инфо("После запуска группы: %1", ЗаданиеСсылка);
			
			// уходим на следующее по цепочке задание (здесь - на следующую группу)
			ЕстьСледующий = ЗначениеЗаполнено(ЗаданиеСсылка.СледующаяПроцедура);
			Если ЕстьСледующий Тогда
				ЗаданиеСсылка = ЗаданиеСсылка.СледующаяПроцедура;
			КонецЕсли;
			
		КонецЦикла;
		
		клог.инфо("КСП_класс_ЗапускЗаданий.ЗапуститьГруппуВФоне():: Выполнение цепочки групп завершено");
		
	Исключение
		т = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		клог.Крит("КСП_класс_ЗапускЗаданий.ЗапуститьГруппуВФоне():: Ошибка. Подробности: %1", т);
		ВызватьИсключение ;
	КонецПопытки;

КонецПроцедуры

//@рекурсия
//@proxy КСП_УправлениеЗаданиямиСервер.ЗапускЗаданияДляЭлементаСправочникаTaskManagement()
//
// создание и запуск регламентных заданий первого уровня в фоне
//	на основе переданного элемента справочника в структуре параметров
//
//Параметры:
//	СтруктураПараметров - Структура параметров фонового задания
//Возвращаемое значение:
//	булево
Процедура ЗапускЗаданияДляЭлементаСправочникаTaskManagement(СтруктураПараметров, ОбщиеПараметры) Экспорт
	
	ИдВызоваКорень    		= СтруктураПараметров.ИдВызоваКорень;
	ИдВызоваРодитель  		= СтруктураПараметров.ИдВызова;
	Задание           		= СтруктураПараметров.ЗаданиеСсылка;
	НомерЗадания	  		= СтруктураПараметров.СчЗаданий;
	ЭтоЦепочка		  		= СтруктураПараметров.ЭтоЦепочка;
	ИдентификаторЗадания 	= СтруктураПараметров.ИдентификаторЗадания;
	НомерИтерации 			= СтруктураПараметров.НомерИтерации;
	
	// этот ИдВызова не связан с цепочкой???
	ИдВызова = КСП_ЛоггерСервер.СоздатьИдВызова( //ИдВызоваРодитель     // <<-- Если хотим иерархии внутри цепочки, надо раскомментировать
	, "Фоновое задание. Итерация ("+НомерИтерации+"): "+Задание.Наименование, ТекущаяДатаСеанса(),
	"ЗапускЗаданияДляЭлементаСправочникаTaskManagement", ИдВызоваРодитель.ПараметрыВызова);
	
	// обязательно в попытке, иначе не поймаем баги
	
	Попытка
		
		Если КСП_УправлениеЗаданиямиСлужебный.ЕстьЗапретНаЗапускРегламентногоЗадания() Тогда
			КСП_ЛоггерСервер.Информация(ИДВызова,"Завершение по терминальной константе","Обработка регламентных заданий окончена.");
			Возврат;
		КонецЕсли;
		
		Если НЕ РазрешенЗапускПоУсловиям(Задание) Тогда
			// запуск задания запрещен по дополнительным условиям
			КСП_ЛоггерСервер.Информация(ИДВызова,"Запуск задания не разрешен по доп условиям! Задание: "+Строка(Задание));
			Возврат;
		КонецЕсли;
		
		// Проверяем у подчиненного необходимость запуска
		Запускать = Задание.Активность;
		Если НЕ Запускать Тогда
			// Прерываем цепочку
			КСП_ЛоггерСервер.Информация(ИДВызова, "Цепочка прервана", "Выключен флаг Активность у следующего задания: "+Строка(Задание));
			Возврат;
		КонецЕсли;
		
		//{ Выполнение метода с фиксацией статуса
		
		//ЗаписатьСтатус(ИДВызова,Задание,Перечисления.КСП_СтатусВыполнения.Выполняется,ИдентификаторЗадания);
		ЗаписатьСтатусВыполняется(ИдВызова,Задание,ИдентификаторЗадания);
		
		_Задание = Строка(Задание);
		
		Если Задание.ЭтоГруппа Тогда
			ВызватьИсключение "Задание является группой. Запуск группы запрещен в этом методе! "+_Задание;
		КонецЕсли;
		
				//ИмяМетода 			= "КСП_класс_ЗапускЗаданий.ЗапускМассиваПараллельныхЗаданий";
				////ИмяЗадания 			= ИмяМетода+":"+Задание.Наименование;
				////Ключ 				= КСП_УправлениеЗаданиямиСервер.СформироватьУникальныйКлючЗадания(Задание);
				//МассивПараметров 	= Новый Массив;
				//МассивПараметров.Добавить(ИдВызоваКорень);
				//МассивПараметров.Добавить(ИдВызова);
				//МассивПараметров.Добавить(Задание);
				//МассивПараметров.Добавить(ИдентификаторЗадания);
				//МассивПараметров.Добавить(ОбщиеПараметры);
				//
				//ОбщегоНазначения.ВыполнитьМетодКонфигурации(ИмяМетода,МассивПараметров);

		Попытка
				ИмяМетода 			= Задание.ПроцедураСПараметрами;
				//ИмяЗадания 			= ИмяМетода+":"+Задание.Наименование;
				//Ключ 				= КСП_УправлениеЗаданиямиСервер.СформироватьУникальныйКлючЗадания(Задание);
				ТаблицаПараметров 	= Задание.ПараметрыПроцедуры.Получить();
				МассивПараметров 	= КСП_УправлениеЗаданиямиСервер.ТаблицаПараметровВМассивПараметров(ТаблицаПараметров, ИдВызова,ОбщиеПараметры);
				
				ОбщегоНазначения.ВыполнитьМетодКонфигурации(ИмяМетода, МассивПараметров);
			
		Исключение
			т = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ф = ОписаниеОшибки();
			КСП_ЛоггерСервер.Отладка(ИдВызова,"Ошибка",т);
			КСП_ЛоггерСервер.Ошибка(ИдВызова,"Ошибка",ф);
			//Возврат;
		КонецПопытки;
		
		РезультатВыполнения = ПолучитьРезультатВыполненияЗадания(ИдВызова);
		ЗаписатьСтатусРезультатВыполнения(ИдВызова,Задание,РезультатВыполнения,ИдентификаторЗадания);
		
		
		// рекурсия
		Если ЗначениеЗаполнено(Задание.СледующаяПроцедура) Тогда
			
			ТекЗадание = Задание.СледующаяПроцедура;
			//Если ТекЗадание.ЭтоГруппа тогда
			//	ТекИдентификаторЗадания = Новый УникальныйИдентификатор;
			//Иначе
				ТекИдентификаторЗадания = ИдентификаторЗадания;//СформироватьУникальныйКлючЗадания(ТекЗадание);
			//КонецЕсли;
			
			СтруктураПараметров.Вставить("ЗаданиеСсылка"  , ТекЗадание);
			СтруктураПараметров.Вставить("СчЗаданий", НомерЗадания + 1);
			СтруктураПараметров.Вставить("ИдВызова" , ИдВызова); // В каждой значимой функции должен создаваться свой ИДВызова и присваиваться родительский.
			СтруктураПараметров.Вставить("ЭтоЦепочка",ЗначениеЗаполнено(ТекЗадание.СледующаяПроцедура));
			СтруктураПараметров.Вставить("НомерИтерации",1);
			СтруктураПараметров.Вставить("ИдентификаторЗадания", ТекИдентификаторЗадания);
				
			ЗапускЗаданияДляЭлементаСправочникаTaskManagement(СтруктураПараметров,ОбщиеПараметры);
		КонецЕсли;
		
	Исключение
		т = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КСП_ЛоггерСервер.КритическаяОшибка(ИдВызова, "Ошибка", "Подробности: "+ Строка(т));
		 
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Это серверный обработчик интерактивного запуска.
//
// Запускает элемент (не группу) справочника КСП_УправлениеЗаданиями на выполнение.
// Вызывается из формы списка справочника КСП_УправлениеЗаданиями.
//
// Параметры
//	Задание - СправочникСсылка.КСП_УправлениеЗаданиями - задание, которое надо выполнить.
//	ПараметрыЗадания - ТЗ,массив структур или данные формы структура - параметры задания на форме элемента.
//							Фактически, это параметры метода, указанного в элементе справочника
//
Функция ЗапуститьЭлементСправочника(Знач ИдВызова, Знач Задание, Знач ПараметрыЗадания, Знач БезВопросов,
	Знач ИдВызоваОбработки = Неопределено) Экспорт
	
	// Вызов исключений возможен, т.к. это серверное продолжение интерактивного запуска
	
	Если ТипЗнч(Задание) <> Тип("СправочникСсылка.КСП_УправлениеЗаданиями") Тогда
		ВызватьИсключение "Тип параметра <Задание> отличается от СправочникСсылка.КСП_УправлениеЗаданиями!";
	КонецЕсли;
	Если Задание.ЭтоГруппа Тогда
		ВызватьИсключение "В параметре <Задание> должен быть элемент справочника, а не группа!";
	КонецЕсли;
	
	Ключ = КСП_УправлениеЗаданиямиСервер.СформироватьУникальныйКлючЗадания(Задание)+ТекущаяДатаСеанса();
	
	Попытка
		
		Если БезВопросов Тогда
			ТаблицаПараметров = Задание.ПараметрыПроцедуры.Получить();
		Иначе
			Если ТипЗнч(ПараметрыЗадания) = Тип("ДанныеФормыСтруктура") Тогда
				ТаблицаПараметров = ДанныеФормыВЗначение(ПараметрыЗадания,Тип("ТаблицаЗначений"));
			ИначеЕсли ТипЗнч(ПараметрыЗадания) = Тип("ТаблицаЗначений") Тогда
				ТаблицаПараметров = ПараметрыЗадания;
			ИначеЕсли ТипЗнч(ПараметрыЗадания) = Тип("Массив") Тогда
				ТаблицаПараметров = ПараметрыЗадания;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ИдВызоваОбработки <> Неопределено Тогда
			ВызОбъект = ИдВызоваОбработки.ПолучитьОбъект();
			ВызОбъект.Родитель = ИдВызова;
			ВызОбъект.Записать();
		КонецЕсли;
		
		МассивПараметров = КСП_УправлениеЗаданиямиСервер.ТаблицаПараметровВМассивПараметров(ТаблицаПараметров,ИдВызова);
		
	Исключение
		РезультатВыполнения = Перечисления.КСП_СтатусВыполнения.ПрерываниеВыполнения;
		ЗаписатьСтатусРезультатВыполнения(ИдВызова,Задание,РезультатВыполнения,Ключ);
		
		ВызватьИсключение;
	КонецПопытки;

	// В массиве параметров должен быть ИДВызова первым параметром (если есть подсистема логирования)
	Если МассивПараметров = Неопределено Тогда
		РезультатВыполнения = Перечисления.КСП_СтатусВыполнения.ПрерываниеВыполнения;
		ЗаписатьСтатусРезультатВыполнения(ИдВызова,Задание,РезультатВыполнения,Ключ);
		ВызватьИсключение "Ошибки при установке параметров!";
	КонецЕсли;

	//ЗаписатьСтатус(ИдВызова,Задание,Перечисления.КСП_СтатусВыполнения.Выполняется,Ключ);
	ЗаписатьСтатусВыполняется(ИдВызова,Задание,Ключ);
	
	// Выполним метод
	
	ВыполненоУспешно = Ложь;
	т = "";
	ф = "";
	Попытка
		ОбщегоНазначения.ВыполнитьМетодКонфигурации(Задание.ПроцедураСПараметрами, МассивПараметров);
		ВыполненоУспешно = Истина;
	Исключение
		
		т = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ф = ОписаниеОшибки();	
		//ВызватьИсключение;
	КонецПопытки;
	
	Если ВыполненоУспешно Тогда
		РезультатВыполнения = ПолучитьРезультатВыполненияЗадания(ИДВызова);
	Иначе
		КСП_ЛоггерСервер.Ошибка(ИдВызова, "Ошибка", ф);
		КСП_ЛоггерСервер.Отладка(ИдВызова, "Ошибка", т);
		РезультатВыполнения = Перечисления.КСП_СтатусВыполнения.ПрерываниеВыполнения;
		
	КонецЕсли;
	
	ЗаписатьСтатусРезультатВыполнения(ИдВызова,Задание,РезультатВыполнения,Ключ);
	
	Возврат ИдВызова;//для метода ОбработатьРезультатЗапускаЭлемента() в форме списка спр УправлениеЗаданиями
	
КонецФункции

#КонецОбласти

#Область ЗапускФоновыхЗаданийИзСправочникаКСП_УправлениеЗаданиями

// Создает массив заданий из групп и элементов внутри родителя (группы спр Задания, параметр Родитель) и запускает все на выполнение.
//Параметры:
//	КорневойИДВызова		- справочникСсылка.ИндексЛога
//	ИдВызова				- справочникСсылка.ИндексЛога
//  ГруппаЗаданийСсылка		- справочникСсылка.КСП_УправлениеЗаданиями
//	ИдентификаторЗадания 	- строка
//	ОбщиеПараметры			- структура
//
Процедура ЗапускМассиваПараллельныхЗаданий(Знач КорневойИДВызова,Знач ИдВызова,
	ГруппаЗаданийСсылка, Знач ИдентификаторЗадания,Знач ОбщиеПараметры) Экспорт
	
	Если ИДВызова = Неопределено Тогда
		ИдВызова = КорневойИДВызова;
	КонецЕсли;
	
	ПрефиксЛога = "КСП_класс_ЗапускЗаданий.ЗапускМассиваПараллельныхЗаданий():: ";
	
	клог = КСП_ЛоггерСервер.СоздатьЛоггер(ИДВызова, "ЗапускМассиваПараллельныхЗаданий");
	клог.инфо("%1>> Запуск группы """+ГруппаЗаданийСсылка.Наименование+"""", ПрефиксЛога);
	
	Если КСП_УправлениеЗаданиямиСлужебный.ЕстьЗапретНаЗапускРегламентногоЗадания() Тогда
		клог.Инфо("%1 Прерывание до момента запуска какого-либо элемента через фоновое задание. Обнаружен запрет на запуск регл. заданий",ПрефиксЛога);
		Возврат;
	КонецЕсли;
	
	// эти фоновые задания мы будем ожидать после запуска
	МассивФонЗаданий = Новый Массив;
	
	// Получить массив заданий, которые будут запущены параллельно. Это могут быть,
	// в том числе, первые задания цепочек.
	МассивПараллельных = ПолучитьМассивЗаданий(ГруппаЗаданийСсылка);
	
	клог.дебаг("%1 Список заданий (элементов в группе) на запуск (первые элементы цепочек):", ПрефиксЛога);
	Для Каждого Эл Из МассивПараллельных Цикл
		клог.дебаг("%1 "+строка(Эл.Код)+":"+Эл.Наименование+":"+эл.ПроцедураСПараметрами, ПрефиксЛога);
	КонецЦикла;
	
	Счетчик = 0;
	
	Попытка
		
		//			запуск заданий					//
		//////////////////////////////////////////////
		Для Каждого ЗаданиеСсылка Из МассивПараллельных Цикл
			
			Запускать = ЗаданиеСсылка.Активность;
			Если Не Запускать Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ РазрешенЗапускПоУсловиям(ЗаданиеСсылка) Тогда
				Продолжить;
			КонецЕсли;
			
			Счетчик = Счетчик+1;
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("ИдВызоваКорень" 		, КорневойИДВызова);
			СтруктураПараметров.Вставить("ЗаданиеСсылка"  		, ЗаданиеСсылка);
			СтруктураПараметров.Вставить("СчЗаданий"			, Счетчик);
			СтруктураПараметров.Вставить("ИдВызова" 			, ИдВызова); // В каждой значимой функции должен создаваться свой ИДВызова
			СтруктураПараметров.Вставить("ЭтоЦепочка"			, ЗначениеЗаполнено(ЗаданиеСсылка.СледующаяПроцедура));
			СтруктураПараметров.Вставить("НомерИтерации"		, 1);
			СтруктураПараметров.Вставить("ИдентификаторЗадания"	, ИдентификаторЗадания);
					
			Если КСП_Функции.МожноВыполнитьВФоне() Тогда//fix2 2024-02-23
				
				Если ЗаданиеСсылка.ЭтоГруппа Тогда
					клог.инфо("%3 Это вложенная группа ""%1"". Запускаем фоновое задание (группу): %2", ЗаданиеСсылка, "ЗапускГруппыЗаданий()", ПрефиксЛога);
					
					//СУУ_ЕНС 16.03.2021 Отключил
					//ИдентификаторЗадания_ = Новый УникальныйИдентификатор;
					ИдентификаторЗадания_  = ИдентификаторЗадания;
					_ИмяПроцедуры = ЗаданиеСсылка.ПроцедураСПараметрами;
					Попытка
						ФонЗадание = ВыполнитьГруппуВФоне(клог, ЗаданиеСсылка, ОбщиеПараметры, ИдентификаторЗадания_);
					Исключение
					    //Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
						т				= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
						клог.ерр("%1 ВыполнитьГруппуВФоне(). Ошибка выполнения фонового задания. Имя метода "+_ИмяПроцедуры+". Подробности: "+т, ПрефиксЛога);
						ФонЗадание = Неопределено;
					КонецПопытки;

				Иначе
					клог.инфо("%3 Это элемент ""%1"". Запускаем фоновое задание (элемент) с методом: %2", ЗаданиеСсылка,
						"ЗапускЗаданияДляЭлементаСправочникаTaskManagement()", ПрефиксЛога);
					
					_ИмяПроцедуры = ЗаданиеСсылка.ПроцедураСПараметрами;
					Попытка
						ФонЗадание = ВыполнитьЭлементВФоне(ИдВызова, ЗаданиеСсылка, СтруктураПараметров, ОбщиеПараметры);
					Исключение
					    //Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
						т				= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
						клог.ерр("%1 ВыполнитьЭлементВФоне(). Ошибка выполнения фонового задания. Имя метода "+_ИмяПроцедуры+". Подробности: "+т, ПрефиксЛога);
						ФонЗадание = Неопределено;
					КонецПопытки;
					
				КонецЕсли;
				
				Если ФонЗадание <> Неопределено Тогда
					МассивФонЗаданий.Добавить(ФонЗадание);
				КонецЕсли;
				
			Иначе
				ЗапускЗаданияДляЭлементаСправочникаTaskManagement(СтруктураПараметров,ОбщиеПараметры);
				
			КонецЕсли;
			
		КонецЦикла;
		
		//				ожидание					//
		//////////////////////////////////////////////
		Если КСП_Функции.МожноВыполнитьВФоне() Тогда
			
			ИмяПроцедуры = "";//здесь могут быть разные методы, поэтому оставляем пустым.
			
			//ОжидатьМассивЗаданий(клог, МассивФонЗаданий, ИмяПроцедуры);                        
			//ЕНС 2024-05-25 поменял параметр ЗаданиеСсылка на группу. 
			//КСП_класс_ФоновыеЗадания.ОжидатьМассивЗаданий(клог, МассивФонЗаданий, ЗаданиеСсылка, ИмяПроцедуры);
			КСП_класс_ФоновыеЗадания.ОжидатьМассивЗаданий(клог, МассивФонЗаданий, ГруппаЗаданийСсылка, ИмяПроцедуры);
			
		КонецЕсли;
		
		клог.инфо("%1 >> Завершение работы пакета """+ГруппаЗаданийСсылка.Наименование+"""", ПрефиксЛога);
		
	Исключение
		т = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		клог.ерр("%1 Подробности: "+т, ПрефиксЛога);
	КонецПопытки;
	
КонецПроцедуры

// Создает массив, элементами которого являются первые задания в цепочках
Функция ПолучитьМассивЗаданий(ГруппаСсылка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Родитель",ГруппаСсылка);
	ТолькоЗапускаемыеПоРасписанию = Ложь;
	Запрос.Текст = ТекстЗапросаВыбораЦепочекЗаданий(ТолькоЗапускаемыеПоРасписанию);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// 				запуск фонового задания								 //
Функция ВыполнитьЭлементВФоне(ИдВызова, ЗаданиеСсылка, СтруктураПараметров, ОбщиеПараметры)
	
	Префикс			= ?(ЗаданиеСсылка.ЭтоГруппа, "Группа ", "Элемент ");
	ОписаниеЗадачи	= ""+Префикс+""""+ЗаданиеСсылка.Наименование+""", код "+ЗаданиеСсылка.Код+" (регл. авт запуск.)";
	ИмяПроцедуры 	= "КСП_класс_ЗапускЗаданий.ЗапускЗаданияДляЭлементаСправочникаTaskManagement";
	Ключ 			= КСП_УправлениеЗаданиямиСервер.СформироватьУникальныйКлючЗадания(ЗаданиеСсылка); // не может существовать более одного активного задания на один элемент справочника
	
	Если ЗаданиеСТакимКлючомУжеВыполняется(ИдВызова, ИмяПроцедуры, Ключ, ЗаданиеСсылка) Тогда
		КСП_ЛоггерСервер.Ошибка(ИДВызова, "Ошибка",
		"ВыполнитьЭлементВФоне(). Невозможно запустить задание, т.к. задание с таким ключом уже выполняется! Имя метода "+ИмяПроцедуры+". Ключ: "+Ключ);
		Возврат Неопределено;
	КонецЕсли;
		
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(СтруктураПараметров);
	МассивПараметров.Добавить(ОбщиеПараметры);
	
	// запуск фонового задания
	Попытка
		ФоновоеЗадание = ФоновыеЗадания.Выполнить(ИмяПроцедуры, МассивПараметров, Ключ, ОписаниеЗадачи);
	Исключение
		т = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КСП_ЛоггерСервер.Ошибка(ИДВызова, "Ошибка",
		"ВыполнитьЭлементВФоне(). Ошибка выполнения фонового задания. Имя метода "+ИмяПроцедуры+". Подробности: "+т);
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ФоновоеЗадание;
	
КонецФункции

// 				запуск фонового задания								 //
Функция ВыполнитьГруппуВФоне(клог, ЗаданиеСсылка, ОбщиеПараметры, Знач ИдентификаторЗадания)
	
	Префикс			= ?(ЗаданиеСсылка.ЭтоГруппа, "Группа ", "Элемент ");
	ОписаниеЗадачи	= ""+Префикс+""""+ЗаданиеСсылка.Наименование+""", код "+ЗаданиеСсылка.Код+" (регл. авт запуск.)";
	//рекурсия
	ИмяПроцедуры	= "КСП_класс_ЗапускЗаданий.ЗапуститьГруппуВФоне";
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ИдентификаторЗадания = КСП_УправлениеЗаданиямиСервер.СформироватьУникальныйКлючЗадания(ЗаданиеСсылка); // не может существовать более одного активного задания на один элемент справочника
	КонецЕсли;
	
	Контекст = Новый Структура;
	Контекст.Вставить("Ключ",ИдентификаторЗадания);
	Контекст.Вставить("Ссылка",ЗаданиеСсылка);
	Контекст.Вставить("ЭтоЦепочка",ЗначениеЗаполнено(ЗаданиеСсылка.СледующаяПроцедура));
	Контекст.Вставить("ОбщиеПараметры",ОбщиеПараметры);
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Контекст);
	
	// запуск фонового задания
	//Попытка
		
		ФоновоеЗадание	= ФоновыеЗадания.Выполнить(ИмяПроцедуры, МассивПараметров, ИдентификаторЗадания, ОписаниеЗадачи);
		
	//Исключение
	//	т				= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	//	клог.Ошибка("ВыполнитьГруппуВФоне(). Ошибка выполнения фонового задания. Имя метода "+ИмяПроцедуры+". Подробности: "+т);
	//	Возврат Неопределено;
	//КонецПопытки;
	
	Возврат ФоновоеЗадание;

КонецФункции

// проверка
Функция ЗаданиеСТакимКлючомУжеВыполняется(ИдВызова, ИмяПроцедуры, Ключ, Элемент)
	
	Отбор = Новый Структура("ИмяМетода,Состояние,Ключ",
		ИмяПроцедуры, СостояниеФоновогоЗадания.Активно,Ключ);
	
	Попытка
		МассивЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	Исключение
		КСП_ЛоггерСервер.Предупреждение_(ИДВызова, "Предупреждение",
		"Управление фоновыми заданиями. Ошибка получения массива заданий методом ПолучитьФоновыеЗадания().
		|Будет создан новый пустой массив. Подробности:"+Символы.ПС+ОписаниеОшибки());
		
		МассивЗаданий = Новый Массив;
	КонецПопытки;
	
	Если МассивЗаданий.Количество()>0 Тогда
		КСП_ЛоггерСервер.Отладка(ИДВызова, "Отладка", "Задание с таким ключом уже выполняется: "+ Символы.ПС+
		"Ключ: " + Ключ + Символы.ПС + "Задание: " + Строка(Элемент));
		
		Возврат Истина;
		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область УсловияЗапуска

// возвращает флаг необходимости запуска по прописанным условиям
Функция РазрешенЗапускПоУсловиям(Элемент) Экспорт
	
	Расписание 				= ПолучитьРасписаниеИзЭлемента(Элемент);
	
	Если ТипЗнч(Расписание) <> Тип("РасписаниеРегламентногоЗадания") Тогда
		Возврат Истина;
	КонецЕсли;
	
	МассивДнейНедели 		= Расписание.ДниНедели;
	ЗапускРазрешен		 	= РазрешенЗапускВЭтотДеньНедели(ТекущаяДатаСеанса(),МассивДнейНедели);
	
	Возврат ЗапускРазрешен;
	
КонецФункции

#КонецОбласти

#Область РезультатВыполненияЗадания

Функция ПолучитьРезультатВыполненияЗаданийИзГруппы(Родитель,ИдентификаторРегламентногоЗадания) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторФон",ИдентификаторРегламентногоЗадания);
	Запрос.УстановитьПараметр("Родитель",Родитель);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(ВЫБОР
	|				КОГДА ЛогСообщений.ВидСообщения = ЗНАЧЕНИЕ(Перечисление.КСП_СтатусыСообщений.Ошибка)
	|					ТОГДА 1
	|				КОГДА ЛогСообщений.ВидСообщения = ЗНАЧЕНИЕ(Перечисление.КСП_СтатусыСообщений.КритическаяОшибка)
	|					ТОГДА 2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК Результат
	|ИЗ
	|	Справочник.КСП_ЛогСообщений КАК ЛогСообщений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ИндексЛога.Ссылка КАК Ссылка
	|		ИЗ
	|			Справочник.КСП_ИндексЛога КАК ИндексЛога
	|		ГДЕ
	|			ИндексЛога.Ссылка В ИЕРАРХИИ
	|					(ВЫБРАТЬ
	|						Статусы.ИндексЛога
	|					ИЗ
	|						РегистрСведений.КСП_СтатусВыполненияЗаданий.СрезПоследних(, ИдентификаторФон = &ИдентификаторФон) КАК Статусы)) КАК ВсеВызовы
	|		ПО ЛогСообщений._Владелец = ВсеВызовы.Ссылка
	|			И (ЛогСообщений.ВидСообщения = ЗНАЧЕНИЕ(Перечисление.КСП_СтатусыСообщений.Ошибка)
	|				ИЛИ ЛогСообщений.ВидСообщения = ЗНАЧЕНИЕ(Перечисление.КСП_СтатусыСообщений.КритическаяОшибка))";
	
	Результаты = Новый Соответствие;
	Результаты.Вставить(0,Перечисления.КСП_СтатусВыполнения.ВыполненоБезОшибок);
	Результаты.Вставить(1,Перечисления.КСП_СтатусВыполнения.ВыполненоСОшибками);
	Результаты.Вставить(2,Перечисления.КСП_СтатусВыполнения.ПрерываниеВыполнения);
	
	Рез = Запрос.Выполнить();
	
	Если Рез.Пустой() Тогда
		Возврат Результаты[0];
	КонецЕсли;
	Возврат Результаты[Рез.Выгрузить()[0][0]];
КонецФункции

//возвращает статус выполнения задания
//Параметры:
//	ИдВызова - ИД вызова
//Возвращаемое значение:
// тип: Перечисления.КСП_СтатусВыполнения
Функция ПолучитьРезультатВыполненияЗадания(ИдВызова) Экспорт
	
	ЗаписьЖурналаРегистрации("ПолучитьРезультатВыполненияЗадания()",
		УровеньЖурналаРегистрации.Информация,,ИдВызова,"Вызов метода");
	
	ЗапросКритические = Новый Запрос;
	ЗапросКритические.УстановитьПараметр("ИДВызова",ИдВызова);
	ЗапросКритические.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ИЗ
	|	Справочник.КСП_ИндексЛога КАК ИндексЛога
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КСП_ЛогСообщений КАК ЛогСообщений
	|		ПО ИндексЛога.Ссылка = ЛогСообщений._Владелец
	|ГДЕ
	|	ИндексЛога.Ссылка В ИЕРАРХИИ(&ИдВызова)
	|	И ЛогСообщений.ВидСообщения = ЗНАЧЕНИЕ(Перечисление.КСП_СтатусыСообщений.КритическаяОшибка)";
	
	Рез = ЗапросКритические.Выполнить();
	
	Если НЕ Рез.Пустой() Тогда
		ЗаписьЖурналаРегистрации("ПолучитьРезультатВыполненияЗадания()",
			УровеньЖурналаРегистрации.Информация,,ИдВызова,"Определен статус ПрерываниеВыполнения");
		
		Возврат Перечисления.КСП_СтатусВыполнения.ПрерываниеВыполнения;
	КонецЕсли;
	
	ЗапросПростые = Новый Запрос;
	ЗапросПростые.УстановитьПараметр("ИДВызова",ИдВызова);
	ЗапросПростые.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ИЗ
	|	Справочник.КСП_ИндексЛога КАК ИндексЛога
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Инд.Ссылка КАК Ссылка
	|		ИЗ
	|			Справочник.КСП_ИндексЛога КАК Инд
	|		ГДЕ
	|			Инд.Ссылка В ИЕРАРХИИ(&ИдВызова)) КАК ВсеИндексыЛога
	|		ПО ИндексЛога.Ссылка = ВсеИндексыЛога.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КСП_ЛогСообщений КАК ЛогСообщений
	|		ПО ИндексЛога.Ссылка = ЛогСообщений._Владелец
	|			И (ЛогСообщений.ВидСообщения = ЗНАЧЕНИЕ(Перечисление.КСП_СтатусыСообщений.Ошибка))";
	
	Рез = ЗапросПростые.Выполнить();
	
	Если НЕ Рез.Пустой() Тогда
		ЗаписьЖурналаРегистрации("ПолучитьРезультатВыполненияЗадания()",
			УровеньЖурналаРегистрации.Информация,,ИдВызова,"Определен статус ВыполненоСОшибками");
			
		Возврат Перечисления.КСП_СтатусВыполнения.ВыполненоСОшибками;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("ПолучитьРезультатВыполненияЗадания()",
		УровеньЖурналаРегистрации.Информация,,ИдВызова,"Определен статус ВыполненоБезОшибок");
		
	Возврат Перечисления.КСП_СтатусВыполнения.ВыполненоБезОшибок;
КонецФункции

#КонецОбласти

#Область РасписаниеЗаданий

// получает значение расписания из реквизита Расписание
Функция ПолучитьРасписаниеИзЭлемента(Элемент) Экспорт
		
	Расписание = Элемент.Расписание.Получить();
	Если ТипЗнч(Расписание) <> Тип("РасписаниеРегламентногоЗадания") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Расписание;
КонецФункции

// проверяет возможность запуска в день недели, который соответствует параметру Дата
//Параметры:
//	ИДВызова - СправочникСсылка.КСП_ИндексЛога
//	Дата - дата проверки
//	МассивДнейНедели - Массив	
Функция РазрешенЗапускВЭтотДеньНедели(Знач Дата, МассивДнейНедели) Экспорт
	
	Индекс = МассивДнейНедели.Найти(ДеньНедели(Дата));
	
	Возврат (Индекс <> Неопределено);
		
КонецФункции

Функция ТребуетсяВыполнениеПоРасписанию(ИдВызова,ДатаДляПроверки,Расписание,РезультатВыполнения) Экспорт
	Попытка
		//Расписание.ВремяЗавершения
		//Расписание.ВремяКонца
		//Расписание.ВремяНачала
		//Расписание.ДатаКонца
		//Расписание.ДатаНачала
		//Расписание.ДеньВМесяце
		//Расписание.ДеньНеделиВМесяце
		//Расписание.ДниНедели
		
		ДатаПроверки = НачалоДня(ДатаДляПроверки);
		ВремяПроверки = Дата(Формат(ДатаДляПроверки,"ДФ=00010101HHmmss"));
		
		Запускать = Истина;
		
		//Проверим, что на дату проверки необходим запуск
		Если ЗначениеЗаполнено(Расписание.ДатаНачала) Тогда
			Если ДатаПроверки >=Расписание.ДатаНачала Тогда
				// По времени запускать можно
				Запускать = Истина;
			Иначе
				Возврат Ложь;
			КонецЕсли;
			
		КонецЕсли;

		Если ЗначениеЗаполнено(Расписание.ДатаКонца) Тогда
			Если ДатаПроверки <= Расписание.ДатаКонца Тогда
				// По времени запускать можно
				Запускать = Истина;
			Иначе
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;

		КСП_ЛоггерСервер.отладка(ИДВызова, "Отладка",
			"ВремяПроверки: "+ВремяПроверки+Символы.ПС+
			"Расписание.ВремяНачала: "+ Расписание.ВремяНачала+Символы.ПС+
			"Расписание.ВремяКонца: " + Расписание.ВремяКонца);

		// Проверим что на время проверки необходим запуск
		Если ВремяПроверки >=Расписание.ВремяНачала И ВремяПроверки < Расписание.ВремяКонца Тогда
			// По времени запускать можно
			Запускать = Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
		// проверки на период повтора
		Если Расписание.ПериодПовтораДней = 0 Тогда
			// разовый запуск - если результат выполнения <> Неопределено, то можно иначе нельзя
			Если РезультатВыполнения.СтатусВыполнения = Неопределено Тогда
				Запускать = Истина;
			Иначе
				// уже запускался - 
				Возврат Ложь;
			КонецЕсли;
		Иначе
			// период повтора
			// смотрим дату последнего запуска и плюсуем период повтора
			Если РезультатВыполнения.СтатусВыполнения = Неопределено Тогда
				Запускать = Истина;
			Иначе
				Запускать = КонецДня(ДатаДляПроверки) >=(НачалоДня(РезультатВыполнения.Начало) + Расписание.ПериодПовтораДней * 86400);
			КонецЕсли;
		КонецЕсли;
		
		//Проверка на дни недели
		Запускать = Расписание.ДниНедели.Найти(ДеньНедели(ДатаДляПроверки))<>Неопределено;
		
		//проверка на день в месяце
		
		//проверка на день недели в месяце
		
		КСП_ЛоггерСервер.ЗаписатьСообщение(ИДВызова, "Отладка",
		Перечисления.КСП_СтатусыСообщений.Информация,
		"Функция ТребуетсяВыполнениеПоРасписанию(). Подробности:"+Символы.ПС+
		"ВремяПроверки:" +ВремяПроверки+Символы.ПС+
		"Расписание.ВремяНачала:" +Расписание.ВремяНачала+Символы.ПС+
		"Расписание.ВремяКонца:" +Расписание.ВремяКонца+Символы.ПС+
		"ВремяПроверки >=Расписание.ВремяНачала И ВремяПроверки < Расписание.ВремяКонца:" +Булево(ВремяПроверки >=Расписание.ВремяНачала И ВремяПроверки < Расписание.ВремяКонца) + Символы.ПС+
		"Расписание.ПериодПовтораДней: " + Расписание.ПериодПовтораДней + Символы.ПС+
        "КонецДня(ДатаДляПроверки) >=(НачалоДня(РезультатВыполнения.Начало) + Расписание.ПериодПовтораДней * 86400): " + Булево(КонецДня(ДатаДляПроверки) >=(НачалоДня(РезультатВыполнения.Начало) + Расписание.ПериодПовтораДней * 86400)) + Символы.ПС+
		"РезультатВыполнения.СтатусВыполнения: " + РезультатВыполнения.СтатусВыполнения + Символы.ПС+
		"Расписание.ДниНедели.Найти(ДеньНедели(ДатаДляПроверки): " + Расписание.ДниНедели.Найти(ДеньНедели(ДатаДляПроверки)) + Символы.ПС+
		"ТребуетсяВыполнениеПоРасписанию: " +Запускать
		);
		
		Возврат Запускать;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область СтатусыЗаданий

// Записывает статус результата выполнения задания в регистр сведений КСП_СтатусВыполненияЗаданий
//Параметры:
//	ИдВызова,
//	Задание - спр ссылка КСП_УправлениеЗаданиями - задание для выполнения
//	СтатусВыполнения - перечисление КСП_СтатусВыполнения - новый статус для записи в регистр
//	ИдентификаторФон - строка - произвольный идентификатор задания
//Возвращаемое значение:
//	нет
Процедура ЗаписатьСтатусРезультатВыполнения(ИдВызова,Задание,СтатусВыполнения,ИдентификаторФон = Неопределено) Экспорт
	
	ДатаЗаписи = ТекущаяДатаСеанса();
		
	Запрос = Новый запрос;
	Запрос.УстановитьПараметр("Задание",Задание);
	Запрос.УстановитьПараметр("ВремяВызова",ИДВызова.ВремяВызова);
	Запрос.УстановитьПараметр("ИндексЛога",ИДВызова);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Рег.Период КАК Период,
	               |	Рег.Задание КАК Задание,
	               |	Рег.СтатусВыполнения КАК СтатусВыполнения,
	               |	Рег.ИндексЛога КАК ИндексЛога,
	               |	Рег.ДатаНачала КАК ДатаНачала,
	               |	Рег.ДатаОкончания КАК ДатаОкончания,
	               |	Рег.ИдентификаторФон КАК ИдентификаторФон
	               |ИЗ
	               |	РегистрСведений.КСП_СтатусВыполненияЗаданий.СрезПоследних(&ВремяВызова, Задание = &Задание) КАК Рег
	               |ГДЕ
	               |	Рег.СтатусВыполнения = ЗНАЧЕНИЕ(Перечисление.КСП_СтатусВыполнения.Выполняется)
	               |	И Рег.ИндексЛога = &ИндексЛога";

	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;

	ДанныеЗаписи = Результат.Выгрузить()[0];
	
	НаборЗаписей = РегистрыСведений.КСП_СтатусВыполненияЗаданий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Задание.Установить(Задание);
	НаборЗаписей.Отбор.Период.Установить(ДанныеЗаписи.Период);
	НаборЗаписей.Прочитать();
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.СтатусВыполнения = СтатусВыполнения;
		Запись.ДатаОкончания 	= ДатаЗаписи;
	КонецЦикла;
	НаборЗаписей.Записать();
		
КонецПроцедуры

// Записывает статус в регистр сведений КСП_СтатусВыполненияЗаданий
//Параметры:
//	ИдВызова,
//	Задание - спр ссылка КСП_УправлениеЗаданиями - задание для выполнения
//	ИдентификаторФон - строка - произвольный идентификатор задания
//Возвращаемое значение:
//	нет
Процедура ЗаписатьСтатусВыполняется(ИдВызова,Задание,ИдентификаторФон = Неопределено) Экспорт
	
	НаборЗаписей = РегистрыСведений.КСП_СтатусВыполненияЗаданий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Задание.Установить(Задание);
	НаборЗаписей.Отбор.Период.Установить(ИДВызова.ВремяВызова);
	//первоначальное добавление записи
	Запись = НаборЗаписей.Добавить();
	Запись.Период 			= ИДВызова.ВремяВызова;
	Запись.Задание 			= Задание;
	Запись.СтатусВыполнения = Перечисления.КСП_СтатусВыполнения.Выполняется;
	Запись.ДатаНачала 		= ТекущаяДатаСеанса();
	Запись.ИдентификаторФон = ?(ИдентификаторФон=Неопределено,"",ИдентификаторФон);
	Запись.ДатаОкончания 	= Дата(1,1,1);
	Запись.ИндексЛога 		= ИдВызова;
	Запись.Пользователь 	= Пользователи.ТекущийПользователь();//ИдВызова.Пользователь;
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

Функция ТекстЗапросаВыбораЦепочекЗаданий(ЗапускПоРасписанию = Истина) Экспорт
	ТекстЗапроса = "ВЫБРАТЬ
					|	ЗначенияБезСсылки.Ссылка,
					|	ЗначенияБезСсылки.ЭтоГруппа
					|ПОМЕСТИТЬ ЗначенияБезСсылки
					|ИЗ
					|	Справочник.КСП_УправлениеЗаданиями КАК ЗначенияБезСсылки
					|ГДЕ
					|	ЗначенияБезСсылки.СледующаяПроцедура = ЗНАЧЕНИЕ(Справочник.КСП_УправлениеЗаданиями.ПустаяСсылка)
					|	И ЗначенияБезСсылки.Родитель = &Родитель И НЕ ПометкаУдаления
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	Последний.СледующаяПроцедура КАК Ссылка
					|ПОМЕСТИТЬ ПоследниеВЦепочках
					|ИЗ
					|	Справочник.КСП_УправлениеЗаданиями КАК Последний
					|ГДЕ
					|	Последний.СледующаяПроцедура В
					|			(ВЫБРАТЬ
					|				ЗначенияБезСсылки.Ссылка
					|			ИЗ
					|				ЗначенияБезСсылки) И НЕ ПометкаУдаления
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	НезависимыеЭлементы.Ссылка КАК Ссылка
					|ПОМЕСТИТЬ НезависимыеЭлементы
					|ИЗ
					|	ЗначенияБезСсылки КАК НезависимыеЭлементы
					|ГДЕ
					|	НЕ НезависимыеЭлементы.Ссылка В
					|				(ВЫБРАТЬ
					|					ПоследниеВЦепочках.Ссылка
					|				ИЗ
					|					ПоследниеВЦепочках)
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ПервыеЭлементы.Ссылка
					|ПОМЕСТИТЬ ПервыеЭлементыЦепочек
					|ИЗ
					|	Справочник.КСП_УправлениеЗаданиями КАК ПервыеЭлементы
					|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КСП_УправлениеЗаданиями КАК ВсеЭлементы
					|		ПО ПервыеЭлементы.Ссылка = ВсеЭлементы.СледующаяПроцедура И НЕ ПервыеЭлементы.ПометкаУдаления
					|		И ВсеЭлементы.Родитель = &Родитель
					|ГДЕ
					|	НЕ ПервыеЭлементы.СледующаяПроцедура = ЗНАЧЕНИЕ(Справочник.КСП_УправлениеЗаданиями.ПустаяСсылка)
					|	И ПервыеЭлементы.Родитель = &Родитель
					|	И ВсеЭлементы.СледующаяПроцедура ЕСТЬ NULL
					|;
					
					////////////////////////////////////////////////////////////////////////////////
					/// Элементы,которые МОЖНО запускать параллельно, т.к. они первые в цепочках
					/// или независимы и не имеют ссылок, не факт что все из них запустятся, 
					/// т.к. могут не удовлетворять условию по времени запуска
					
					|ВЫБРАТЬ
					|	ПервыеЭлементыЦепочек.Ссылка
					|ИЗ
					|	ПервыеЭлементыЦепочек КАК ПервыеЭлементыЦепочек "+?(ЗапускПоРасписанию,"где ПервыеЭлементыЦепочек.Ссылка.ЗапускПоРасписанию","")+"
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|
					|ВЫБРАТЬ
					|	НезависимыеЭлементы.Ссылка
					|ИЗ
					|	НезависимыеЭлементы КАК НезависимыеЭлементы "+?(ЗапускПоРасписанию,"где НезависимыеЭлементы.Ссылка.ЗапускПоРасписанию","");

	Возврат ТекстЗапроса;
КонецФункции


// Выполняет проверку
Функция РазрешенЗапускГруппыЗаданий(клог, Контекст)
	
	ЗаданиеСсылка 		= ПолучитьСвойствоКонтекста(Контекст,"Ссылка" ,"СправочникСсылка.КСП_УправлениеЗаданиями");
	ЗапускИзСправочника = ПолучитьСвойствоКонтекста(Контекст,"ЗапускИзСправочника","Булево"); // Нужно чтобы понять что запуск из справочника и не надо делать проверок по недельному расписанию
	
	Если ЗапускИзСправочника=Ложь И НЕ РазрешенЗапускПоУсловиям(ЗаданиеСсылка) Тогда
		// запуск задания запрещен по дополнительным условиям
		клог.Инфо("Обработка регламентных заданий прервана. Запуск не разрешен по условиям");
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗаданиеСсылка.ЭтоГруппа Тогда
		клог.ерр("ЗапуститьГруппуВФоне(). В переменной ЗаданиеСсылка должна быть группа справочника, а не элемент!");
		ВызватьИсключение "ЗапуститьГруппуВФоне(). В переменной ЗаданиеСсылка должна быть группа справочника, а не элемент!";
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Безопасно получает свойство из структуры "Контекст"
Функция ПолучитьСвойствоКонтекста(Контекст,Свойство,ТипСтрокой)
	НайденноеЗначение = Неопределено;
	Если Контекст.Свойство(Свойство,НайденноеЗначение) Тогда
		Возврат НайденноеЗначение;
	Иначе
		Возврат КСП_УправлениеЗаданиямиОбщегоНазначенияСервер.ПолучитьПустоеЗначениеТипа(Тип(ТипСтрокой));
	КонецЕсли;
КонецФункции
